# IFCFileModelOptions Class

---
This class contains options to create an IFC file model.
SystemObject Autodesk.Revit.DB.IFCIFCFileModelOptions
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

    public class IFCFileModelOptions : IDisposable

    Public Class IFCFileModelOptions
    	Implements IDisposable

    public ref class IFCFileModelOptions : IDisposable

    type IFCFileModelOptions =
        class
            interface IDisposable
        end
The IFCFileModelOptions type exposes the following members.
| Name| Description
---|---|---
| IFCFileModelOptions|  Creates a default IFCFileModelOptions. The default schema file is empty and cache size is 8192.
Top
| Name| Description
---|---|---
| CacheSize|  The cache size of the file.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| SchemaFile|  The full name of an IFC schema file.
| SchemaName|  The name of the schema.
| UserControlledInverses|  Indicates if the inverses are controlled by Revit or users. True by users, false by Revit.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the IFCFileModelOptions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.IFC Namespace